timetable = {
    0:{
        's': 14 * 60, # 14 : 00
        'name': 'Обед',
        'e': 15 * 60,  # 19 : 00
        'wd': 'Пт',
        't': '14 : 00 - 15 : 00'
    },
    1:{
        's': 14 * 60,
        'name': 'Начало регистрации',
        'e': 14 * 60 + 30,
        'wd': 'Пт',
        't': '14 : 00'
    },
    2:{
        's': 16 * 60 + 30,
        'name': 'Семинары',
        'seminar_id' : 1,
        'e': 17 * 60 + 30,
        'wd': 'Пт',
        't': '16 : 30 - 17 : 30'
    },
    3:{
        's': 18 * 60,
        'name': 'Семинары',
        'seminar_id' : 2,
        'e': 19 * 60,
        'wd': 'Пт',
        't': '18 : 00 - 19 : 00'
    },
    4:{
        's': 19 * 60,
        'name': 'Ужин',
        'e': 20 * 60,
        'wd': 'Пт',
        't': '19 : 00 - 20 : 30'
    },
    5:{
        's': 20 * 60 + 30,
        'name': 'Торжественное открытие',
        'e': 21 * 60 + 30,
        'wd': 'Пт',
        't': '20 : 30 - 21 : 30'
    },
    6:{
        's': 21 * 60 + 30,
        'name': 'перерыв',
        'e': 22 * 60,
        'wd': 'Пт',
        't': '21 : 30 - 22 : 00'
    },
    7:{
        's': 22 * 60,
        'name': 'Вечерняя программа в зале',
        'e': 23 * 60 + 30,
        'wd': 'Пт',
        't': '22 : 00 - 23 : 30'
    },
    8:{
        's': 1 * 24 * 60 + 8 * 60,
        'name': 'Утренняя молитва',
        'e':  1 * 24 * 60 + 9 * 60,
        'wd': 'Сб',
        't': '8 : 00 - 9 : 00'
    },
    9:{
        's': 1 * 24 * 60 + 9 * 60,
        'name': 'Завтрак',
        'e':  1 * 24 * 60 + 10 * 60,
        'wd': 'Сб',
        't': '9 : 00 - 10 : 00'
    },
    10:{
        's': 1 * 24 * 60 + 10 * 60,
        'name': 'Утреннее Собрание',
        'e': 1 * 24 * 60 + 12 * 60,
        'wd': 'Сб',
        't': '10 : 00 - 12 : 00'
    },
    11:{
        's': 1 * 24 * 60 + 12 * 60,
        'name': 'Детский спектакль',
        'e': 1 * 24 * 60 + 14 * 60,
        'wd': 'Сб',
        't': '12 : 00 - 14 : 00'
    },
    12:{
        's': 1 * 24 * 60 + 12 * 60,
        'name': 'Интеллектуальная игра для взрослых',
        'e': 1 * 24 * 60 + 14 * 60,
        'wd': 'Сб',
        't': '12 : 00 - 14 : 00'
    },
    13: {
        's': 1 * 24 * 60 + 14 * 60,
        'name': 'Обед',
        'e': 1 * 24 * 60 + 15 * 60,
        'wd': 'Сб',
        't': '14 : 00 - 15 : 00'
    },
    14: {
        's': 1 * 24 * 60 + 15 * 60,
        'name': 'Public-talk с пасторами в главном зале\nГуляния, Ярмарка',
        'e': 1 * 24 * 60 + 18 * 60,
        'wd': 'Сб',
        't': '15 : 00 - 18 : 00'
    },
    15: {
        's': 1 * 24 * 60 + 18 * 60,
        'name': 'Семинары',
        'seminar_id': 3,
        'e': 1 * 24 * 60 + 19 * 60,
        'wd': 'Сб',
        't': '18 : 00 - 19 : 00'
    },
    16: {
        's': 1 * 24 * 60 + 18 * 60,
        'name': 'Мастерклассы на третьем этаже',
        'e': 1 * 24 * 60 + 19 * 60,
        'wd': 'Сб',
        't': '18 : 00 - 19 : 00'
    },
    17: {
        's': 1 * 24 * 60 + 19 * 60,
        'name': 'Ужин',
        'e': 1 * 24 * 60 + 20 * 60,
        'wd': 'Сб',
        't': '19 : 00 - 20 : 00'
    },
    18: {
        's': 1 * 24 * 60 + 20 * 60,
        'name': 'Вечер хвалы',
        'e': 1 * 24 * 60 + 22 * 60 + 30,
        'wd': 'Сб',
        't': '20 : 00 - 22 : 30'
    },
    19: {
        's': 1 * 24 * 60 + 22 * 60 + 30,
        'name': 'Рождество в коробке',
        'e': 1 * 24 * 60 + 24 * 60,
        'wd': 'Сб',
        't': '22 : 30 - сколько хотите'
    },
    20: {
        's': 2 * 24 * 60 + 9 * 60,
        'name': 'Утренняя Молитва',
        'e': 2 * 24 * 60 + 10 * 60,
        'wd': 'Вс',
        't': '9 : 00 - 10 : 00'
    },
    21: {
        's': 2 * 24 * 60 + 10 * 60,
        'name': 'Завтрак',
        'e': 2 * 24 * 60 + 10 * 60 + 45,
        'wd': 'Вс',
        't': '10 : 00 - 10 : 45'
    },
    22: {
        's': 2 * 24 * 60 + 10 * 60 + 45,
        'name': 'Утреннее Собрание, крещение',
        'e': 2 * 24 * 60 + 13 * 60,
        'wd': 'Вс',
        't': '10 : 45 - 13 : 00'
    },
    23: {
        's': 2 * 24 * 60 + 13 * 60,
        'name': 'Сборы',
        'e': 2 * 24 * 60 + 14 * 60,
        'wd': 'Вс',
        't': '13 : 00 - 14 : 00'
    },
    24: {
        's': 2 * 24 * 60 + 14 * 60,
        'name': 'Обед',
        'e': 2 * 24 * 60 + 15 * 60,
        'wd': 'Вс',
        't': '14 : 00 - 15 : 00'
    }
}
child = {
    0: {
        's': 17 * 60,
        'name': 'Мастерклассы, Комната A или B',
        'e': 19 * 60,
        'wd': 'Пт',
        't': '17 : 00 - 19 : 00'
    },
    1: {
        's': 20 * 60,
        'name': 'Комната с игрушками, детская комната',
        'e': 22 * 60,
        'wd': 'Пт',
        't': '20 : 00 - 22 : 00'
    },
    2: {
        's': 20 * 60,
        'name': 'Украшение рождественских пряников, комната А',
        'e': 22 * 60,
        'wd': 'Пт',
        't': '10 : 30 - 12 : 00'
    },
    3: {
        's': 1 * 24 * 60 + 12 * 60,
        'name': 'Болшой спектакль',
        'e': 1 * 24 * 60 + 14 * 60,
        'wd': 'Сб',
        't': '12 : 00 - 14 : 00'
    },
    4: {
        's': 1 * 24 * 60 + 15 * 60,
        'name': 'Программа для всех желающих детей, комнаты А, Б',
        'e': 1 * 24 * 60 + 17 * 60,
        'wd': 'Сб',
        't': '15 : 00 - 17 : 00'
    },
    5: {
        's': 1 * 24 * 60 + 17 * 60 + 0,
        'name': 'Комната с игрушками, детская комната',
        'e': 1 * 24 * 60 + 19 * 60 + 0,
        'wd': 'Сб',
        't': '17 : 00 - 19 : 00'
    },
    6: {
        's': 1 * 24 * 60 + 17 * 60 + 0,
        'name': 'Украшение рождественских пряников, комната А',
        'e': 1 * 24 * 60 + 19 * 60 + 0,
        'wd': 'Сб',
        't': '17 : 00 - 19 : 00'
    },
    7: {
        's': 1 * 24 * 60 + 17 * 60 + 0,
        'name': 'Поделки для детей 3 - 5 лет, комната Б',
        'e': 1 * 24 * 60 + 19 * 60 + 0,
        'wd': 'Сб',
        't': '17 : 00 - 19 : 00'
    },
    8: {
        's': 1 * 24 * 60 + 20 * 60 + 30,
        'name': 'Вечерняя программа для детей с угощением, пениями и рождественскими чтениями, \nклассы на третьем этаже',
        'e': 1 * 24 * 60 + 22 * 60 + 0,
        'wd': 'Сб',
        't': '20 : 30 - 22 : 00'
    },
    9: {
        's': 2 * 24 * 60 + 11 * 60 + 15,
        'name': 'Воскресная школа, классы на третьем этаже',
        'e': 2 * 24 * 60 + 12 * 60 + 45,
        'wd': 'Вс',
        't': '11 : 15 - 12 : 45'
    }
}
time0 = {
    's': -4 * 24 * 60 + 14 * 60,
    'e': -4 * 24 * 60 + 15 * 60
}
s0 = {
    't1':{
        'name': 'семинар 11',
        'time': 'Пт - 17 : 30',
        'notify' : ['408598187'],
        'description': 'описание семинара с датой и аудиторией'
    }
}
time1 = {
    's': 0 * 24 * 60 + 16 * 60 + 30,
    'e': 0 * 24 * 60 + 17 * 60 + 30,
}
time2 = {
    's': 0 * 24 * 60 + 18 * 60,
    'e': 0 * 24 * 60 + 19 * 60,
}
time3 = {
    's': 1 * 24 * 60 + 18 * 60,
    'e': 1 * 24 * 60 + 19 * 60,
}
s1 = {
    '0': {
        'name': 'Дети в семье',
        'time': 'Пт - 17 : 30',
        'notify' : list(),
        'description': 'Грушенков, Сазыкин (комната 303)'
    },
    '1': {
        'name': 'Благовестие соседям',
        'time': 'Пт - 17 : 30',
        'notify' : list(),
        'description': 'Кузин, Куров (комната 305)'
    },
    '2': {
        'name': 'Как понять свое призвание?',
        'time': 'Пт - 17 : 30',
        'notify': list(),
        'description': 'Слюсарь, Громов (комната 307)'
    }
}
s2 = {
    '5': {

        'name': 'Хорошо ли человеку быть одному?',
        'time': 'Пт - 18 : 00',
        'notify' : [],
        'description': 'Александров, Зубарев (комната 305)'

    },
    '6': {
        'name': 'Ошибки в нашем благовестии или 101 способ НЕ донести Евангелие',
        'time': 'Пт - 18 : 00',
        'notify' : [],
        'description': ' Сасин, Медведев (комната 307)'

    }
}
s3 = {
    '9': {
        'name': 'Кредит в кредит',
        'time': 'Сб - 18 : 00',
        'notify' : [],
        'description': 'Сысоев, Вапров (комната 303)'

    },
    '10': {
        'name': 'Как найти себя в церкви?',
        'time': 'Сб - 18 : 00',
        'notify' : [],
        'description': 'Алексеев, Вильгельм (комната 305)'

    },
    '11': {
        'name': 'Евангелие [на, в, через, вместо, или] работа',
        'time': 'Сб - 18 : 00',
        'notify' : [],
        'description': 'Богославский, Тимофеев (комната 307)'

    },
}
users = {
    'test_user':{
        'name':'name',
        'surname': 'surname',
        'chat_id': '-1001781532365'
    }
}
cafe_menu_data = {
    'hc250': 'Горячий шоколад - 250 мл',
    'hc350': 'Горячий шоколад - 350 мл',
    'simple_capusino': 'Капучино',
    'not_simple_capusino': 'Капучино на овсянном молоке',
    'simple_capusino+': 'Капучино с доп. шотом',
    'not_simple_capusino+': 'Капучино с доп. шотом на овсянном молоке',
    'sitrus': 'Цитрусовый Раф',
    'halva': 'Раф со вкусом халвы',
    'nut': 'Ореховый раф',
    'classic': 'Раф',
    'americano250': 'Американо 250 мл',
    'americano350': 'Американо 350 мл',
    'espresso50': 'Эспрессо',
    'espresso80': 'Двойной эспрессо',
    'raspberry_ginger250': 'Малина - имбирь 250 мл',
    'raspberry_ginger350': 'Малина - имбирь 350 мл',
    'sea_buckthorn-ginger250': 'Облепиха - имбирь 250 мл',
    'sea_buckthorn-ginger350': 'Облепиха - имбирь 350 мл',
    'orange-ginger250': 'Апельсин -  имбирь 250 мл',
    'orange-ginger350': 'Апельсин -  имбирь 350 мл',
    'meat_tost': 'Мясной тост',
    'sweet_tost': 'Сладкий тост',
    'kakayato_kasha': 'Каша с яблоком и медом',
    'simple_latte': 'Латте',
    'not_simple_latte': 'Латте на овсянном молоке',
    'mulled_wine': 'Глинтвейн',
    'cranberry': 'Чай клюква'
}
cafe_working_time = {
    1: {
        's': 0 * 24 * 60 + 19 * 60 + 30,
        'e': 0 * 24 * 60 + 20 * 60 + 30,
        't': 'пт 19 : 30'
    },
    2: {
        's': 0 * 24 * 60 + 21 * 60 + 30,
        'e': 0 * 24 * 60 + 22 * 60 + 0,
        't': 'пт 21 : 30'
    },
    3: {
        's': 1 * 24 * 60 + 9 * 60 + 15,
        'e': 1 * 24 * 60 + 9 * 60 + 45,
        't': 'пт 9 : 15'
    },
    4: {
        's': 1 * 24 * 60 + 14 * 60 + 15,
        'e': 1 * 24 * 60 + 14 * 60 + 45,
        't': 'пт 14 : 15'
    },
    5: {
        's': 1 * 24 * 60 + 19 * 60 + 15,
        'e': 1 * 24 * 60 + 19 * 60 + 45,
        't': 'пт 19 : 15'
    },
    6: {
        's': 1 * 24 * 60 + 22 * 60 + 0,
        'e': 1 * 24 * 60 + 23 * 60 + 0,
        't': 'пт 22 : 00'
    },
    7: {
        's': 2 * 24 * 60 + 10 * 60 + 15,
        'e': 2 * 24 * 60 + 10 * 60 + 45,
        't': 'пт 10 : 15'
    },
    8: {
        's': 2 * 24 * 60 + 14 * 60 + 15,
        'e': 2 * 24 * 60 + 14 * 60 + 45,
        't': 'пт 14 : 15'
    }
}
